[
    {
      "id": 1,
      "nombre": "Desarrollo Web",
      "descripcion": "Aprende a crear aplicaciones web completas, desde el frontend hasta el backend.",
      "imagen": "imagenes/web.png",
      "descripcion_completa": "En este curso, los estudiantes aprenderán a construir aplicaciones web utilizando tecnologías modernas como HTML, CSS, JavaScript, Node.js y bases de datos SQL. Cubriremos tanto el desarrollo del lado del cliente (frontend) como del servidor (backend), con un enfoque en la creación de proyectos prácticos y funcionales. Al finalizar, los alumnos podrán desarrollar sitios web interactivos y escalables, listos para ser lanzados al mercado.",
      "funcionalidad":"El objetivo es capacitar a los estudiantes para que puedan diseñar, desarrollar y mantener aplicaciones web completas, integrando el lado del cliente y del servidor de manera eficiente.",
      "video": "https://www.youtube.com/watch?v=rnmbxqS1nRo"
    },
    {
      "id": 2,
      "nombre": "Programación ",
      "descripcion": "Domina uno de los lenguajes de programación más populares y versátiles.",
      "imagen": "imagenes/piton.png",
      "descripcion_completa":" Este curso está diseñado para quienes desean aprender a programar desde cero utilizando Python. A lo largo del curso, exploraremos conceptos fundamentales como variables, estructuras de control, funciones, y manejo de errores. También cubriremos el uso de bibliotecas populares como Pandas, NumPy y Matplotlib, ideales para trabajar con datos y desarrollar aplicaciones sencillas y efectivas.",
      "funcionalidad":"Proporcionar una base sólida en programación, permitiendo a los estudiantes desarrollar aplicaciones, analizar datos y automatizar tareas.",
      "video": "https://www.youtube.com/watch?v=_6N18g3ewnw"
    },
    {
      "id": 3,
      "nombre": "Aplicaciones Móviles",
      "descripcion": " Aprende a crear aplicaciones móviles para Android e iOS utilizando frameworks modernos.",
      "imagen": "imagenes/app.png",
      "descripcion_completa":"Este curso abarca el desarrollo de aplicaciones móviles para dispositivos Android e iOS, utilizando tecnologías como React Native. Los estudiantes aprenderán a construir interfaces de usuario, integrar APIs, gestionar bases de datos locales y realizar pruebas. Se enfocará en cómo lanzar aplicaciones móviles al mercado y optimizar su rendimiento para diferentes dispositivos.",
      "funcionalidad":"Capacitar a los estudiantes para desarrollar aplicaciones móviles funcionales y atractivas que puedan ejecutarse en múltiples plataformas.",
      "video": "https://www.youtube.com/watch?v=3_dwKqCsbis"
    },
    {
      "id": 4,
      "nombre": "Inteligencia Artificial",
      "descripcion": "Adéntrate en el fascinante mundo de la inteligencia artificial y sus aplicaciones.",
      "imagen": "imagenes/ia.png",
      "descripcion_completa": "En este curso, los estudiantes explorarán los fundamentos de la inteligencia artificial, incluyendo algoritmos de aprendizaje automático y redes neuronales. Veremos aplicaciones prácticas como la clasificación, regresión, y reconocimiento de patrones, y aprenderemos a aplicar estas técnicas en proyectos reales utilizando Python y bibliotecas como Scikit-Learn y TensorFlow.",
      "funcionalidad":"Introducir a los estudiantes en el campo de la IA, permitiéndoles desarrollar soluciones inteligentes para diversos problemas.",
      "video": "https://www.youtube.com/watch?v=bOQjgy1PhUg"
    }
      
      



  ]
  